using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace XXCloudService.RadarServer
{
    public enum CommandType
    {
        游戏机参数申请 = 0x80,
        游戏机参数申请应答 = 0x10,

        游戏机参数修改 = 0x11,
        游戏机参数修改应答 = 0x81,

        游戏机参数查询 = 0x12,
        游戏机参数查询应答 = 0x82,

        远程投币上分指令 = 0x1c,
        远程投币上分指令应答 = 0x8c,

        IC卡模式会员余额查询 = 0x84,
        IC卡模式会员余额查询应答 = 0x14,

        IC卡模式投币数据 = 0x85,
        IC卡模式投币数据应答 = 0x15,

        IC卡模式退币数据 = 0x83,
        IC卡模式退币数据应答 = 0x13,

        电子币模式投币数据 = 0x86,
        电子币模式投币数据应答 = 0x16,

        电子币模式退币出票数据 = 0x87,
        电子币模式退币出票数据应答 = 0x17,

        机头网络状态报告 = 0x8a,
        机头网络状态报告应答 = 0x1a,

        机头地址动态分配 = 0x8d,
        机头地址动态分配应答 = 0x1d,

        机头地址修改 = 0x1e,
        机头地址修改应答 = 0x8e,

        设置机头长地址 = 0x4f,
        设置机头长地址应答 = 0x9f,

        设置路由器地址 = 0x4e,
        设置路由器地址应答 = 0x9e,

        数据透传广播指令 = 0x4d,
        数据透传广播指令应答 = 0x9d,

        路由器时间控制 = 0x4c,
        路由器时间控制应答 = 0x9c,

        机头卡片报警指令 = 0x89,
        机头卡片报警指令应答 = 0x19,

        远程被动退分解锁指令 = 0x18,
        远程被动退分解锁指令应答 = 0x88,

        机头锁定解锁指令 = 0x1b,
        机头锁定解锁指令应答 = 0x8b,

        退币信号延时检测指令 = 0x41,
        退币信号延时检测指令应答 = 0x91,

        退币信号延时应答指令 = 0x92,
        退币信号延时应答指令应答 = 0x42,

        投币机投币指令 = 0x93,
        投币机投币指令应答 = 0x43,

        卡头程序更新通知 = 0x44,
        卡头程序更新通知应答 = 0x94,

        卡头升级指令 = 0x45,

        网络初始化连接 = 0xff,
    }
}
